In [1]:
import numpy as np
import pandas as pd

In [3]:
#np.nan creates a NaN value using numpy
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [4]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna() 
#Pandas will drop any ROWS with 1+ NaN or missing values

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis=1)
#Pandas will drop any COLUMNS with 1+ NaN or missing values

   C
0  1
1  2
2  3

In [9]:
#thresh argument is an integer threshold.
# Drop rows with at least 2 NaN values. So first 2 rows kept, as row 1 only has 1 NaN value in there
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.fillna(value='STUFF')

       A      B  C
0      1      5  1
1      2  STUFF  2
2  STUFF  STUFF  3

In [12]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [15]:
#sometimes we would like ot fill the NaN value as the mean of the column values
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

As for what exactly we should fill in the NaN, whether means or 0s, depends on the data really